app/views/movies/index.html.erb

          <h2><%= link_to movie.title, movie %> (<%= movie.released_on.year %>)</h2>
          <% if movie.reviews.size == 0 %>
---
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]