app/views/movies/show.html.erb

            <%= f.label :stars %>
            <%= f.select :stars, Review::STARS, prompt: "Pick one" %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]
SELECT MAX("reviews"."stars") AS max_id FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]