app/controllers/movies_controller.rb

  def edit
    #fail
    @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @movie = Movie.find(params[:id])
   if @movie.update(movie_params)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "7"]]
UPDATE "movies" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "movies"."id" = 7  [["image_file_name", "batman.jpg"], ["image_file_size", 8466], ["image_updated_at", Fri, 11 Jul 2014 12:56:28 UTC +00:00], ["updated_at", Fri, 11 Jul 2014 12:56:29 UTC +00:00]]

  def create
    @movie = Movie.new(movie_params)
      if @movie.save
---
INSERT INTO "movies" ("cast", "created_at", "description", "director", "duration", "image_file_name", "rating", "released_on", "title", "total_gross", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)