app/controllers/reviews_controller.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? ORDER BY "reviews"."id" DESC  [["movie_id", 3]]
---
  def index
    @reviews = @movie.reviews.order(id: :desc)

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 3], ["id", "10"]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 10]]
---
  def destroy
    @review = @movie.reviews.find(params[:id])
    @review.destroy